#!/usr/bin/env python3
################################################################################
#   valuta.py
#
#   Model: cuntries currency
#
#   01.08.2018  Created by:  rada
################################################################################
import random
import time

class Currency():
    def __init__(self):
        self.valuta = {
            'США':       'доллар', 'Россия':   'рубль',  'Азербайджан': 'манат', 
            'Албания':   'лек',    'Монголия': 'тугрик', 'Молдавия':    'лей',
            'Германия':  'евро',   'Индия':    'рупия',  'Канада':      'доллар',
            'Израиль':   'шекель', 'Ирак':     'динар',  'Казахстан':   'тенге',
            'Аргентина': 'песо',   'Польша':   'злотый', 'Грузия':      'лари',
            'Китай':     'юань',   'Армения':  'драм',   'Корея':       'вона',
            'Швейцария': 'франк',  'Япония':   'йена',   'ЮАР':         'рэнд', 
            'Египет':    'фунт',   'Швеция':   'крона',  'Афганистан':  'афгани',
            'Исландия':  'крона',  'Иран':     'риал',   'Турция':      'лира'
        }

        self.countries = list(self.valuta.keys())
    
    def reset(self):
        random.seed(time.time())
        random.shuffle(self.countries)

